/**
 * Created by uinnova on 2017/9/14.
 */
//测试接口开关
var ajax = false;  // true为打开接口数据，false为关闭接口数据
var options  = {
    type: "post",
    url: "",
    data: {},
    dataType: "JSON"
};      // ajax请求参数
var json = {
    data: {
        '哈尔滨市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '齐齐哈尔市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '鸡西市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '鹤岗市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '双鸭山市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '大庆市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '伊春市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '佳木斯市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '抚远县': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '七台河市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '牡丹江市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '绥芬河市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '黑河市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '绥化市': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        },
        '大兴安岭地区': {
            '总人口':{
                '类型':{
                    '常驻人口': '302',
                    '暂住人口': '432',
                    '重点人口': '0.3'
                },
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '685',
                    '女': '464'
                }
            },
            '常驻人口':{
                '适龄':{
                    '0-15岁': '258',
                    '16-60岁': '226',
                    '60岁以上': '210'
                },
                '性别':{
                    '男': '285',
                    '女': '264'
                }
            },
            '暂住人口':{
                '适龄':{
                    '0-15岁': '208',
                    '16-60岁': '216',
                    '60岁以上': '110'
                },
                '性别':{
                    '男': '247',
                    '女': '231'
                }
            },
            '重点人口':{
                '重点人口分类':{
                    '重点上访人员': '307',
                    '涉稳人员': '290',
                    '刑事犯罪前科人员': '149',
                    '涉恐人员': '39',
                    '吸毒人员': '235',
                    '涉毒人员': '479',
                    '在逃人员': '34'
                },
                '适龄':{
                    '0-15岁': '118',
                    '16-60岁': '916',
                    '60岁以上': '75'
                },
                '性别':{
                    '男': '879',
                    '女': '527'
                }
            }
        }
    },
    "message" : {},
    "success" : true
};
var cityCode = {
    "101201010000": "哈尔滨市",
    "101201020000": "齐齐哈尔市",
    "101201030000": "牡丹江市",
    "101201040000": "佳木斯市",
    "101201050000": "大庆市",
    "101201060000": "伊春市",
    "101201070000": "鸡西市",
    "101201080000": "鹤岗市",
    "101201090000": "双鸭山市",
    "101201100000": "七台河市",
    "101201110000": "绥化市",
    "101201120000": "黑河市",
    "101201130000": "大兴安岭地区",
    "101201150000": "绥芬河市",
    "101201160000": "抚远县"
};

var  populationType = {
    '1': '总人口',
    '2': '常驻人口',
    '3': '暂住人口',
    '4': '重点人口'
};

//测试方法-------------------------------------------
function mystartInterval(obj) {
    if(ajax) {
        if (obj == null && obj == undefined) {
            //alert('数据不能为空');
            return false;
        }
        var data = {'type': '5'};
        var newObj = obj;
        data.code = newObj.code;
        options.data = JSON.stringify(data);
        //接口数据
        initPage(options, function (data) {
            initHtml(data);
        });
    }else{
        //测试数据
        if (obj == null && obj == undefined) {
            //alert('数据不能为空');
            return false;
        }
        if (typeof obj == "string") {
            var parseObj = JSON.parse(obj);
        } else {
            var parseObj = obj;
        }
        var id = parseObj.id;
        var caption = cityCode[parseObj.code];
        var cityObj = json.data[caption];
        var typeObj = cityObj[populationType[id]]
        var data = {};
        var a ={};
        var b = {};
        a[populationType[id]] = typeObj;
        b[caption] = a;
        data.data = b;
        initHtml(data);
    }
}


function initHtml(obj) {

    if (obj == null && obj == undefined) {
        //alert('数据不能为空');
        return false;
    }
    var json = null;
    if (typeof obj == "string") {
        var parseObj = JSON.parse(obj).data;
        for(var caption in parseObj) {
            $(".h-Title").text(caption);
            for(var type in parseObj[caption]) {
                var sum = 123456;
                $(".Subtitle").text(type+"数量: "+sum+"万");
                json = parseObj[caption][type];
            }
        }
    } else {
        var parseObj = obj.data;
        for(var caption in parseObj) {
            $(".h-Title").text(caption);
            for(var type in parseObj[caption]) {
                var sum = 123456;
                $(".Subtitle").text(type+"数量: "+sum+"万");
                json = parseObj[caption][type];
            }
        }
    }

    var jsonLength = Object.getOwnPropertyNames(json).length;
    var htmlInfo = '';
    $('#pies').empty();
    for(var item in json) {
        var piesHeight = document.getElementById('pies').offsetHeight;
        var pieWidth = document.getElementById('pies').offsetWidth;
        var pieHeight = piesHeight/jsonLength;
        htmlInfo +='<li><span id="'+item+'" style="height: '+pieHeight+"px"+';width: '+pieWidth+"px"+'"></span></li>'
    }
    $('#pies').append(htmlInfo);

    for(var info in json) {
        var chart = document.getElementById(info);
        var myChart = echarts.init(chart);

        var typeData = json[info];

        Pie(myChart, typeData, {radius: ['0%', '55%']}, info)
    }
}


var testObj = {
    id: 1,
    code: "101201010000"
};

mystartInterval(JSON.stringify(testObj));
